[
  {
    "id": "f4cea646-1f1c-4d8e-baf8-bd561282a982",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f4cea646-1f1c-4d8e-baf8-bd561282a982",
    "created_at": "Thu Apr 29 09:26:07 UTC 2021",
    "company": "Scanbot / doo GmbH",
    "company_url": "https://scanbot.io",
    "location": "Bonn, Germany",
    "title": "Senior Cross-Platform Developer (m/f/d) - For our location in Bonn",
    "description": "<p>Hi!</p>\n<p>We are Scanbot / doo GmbH! We are a German software development company founded in 2011, with business presences in Bonn and San Francisco. Scanbot enables the integration of scanning and data extraction functionalities into existing mobile applications for the insurance, healthcare, logistics, and banking industry. The Software Development Kit (SDK) utilizes highly sophisticated algorithms and machine learning to integrate scanning functionalities and data extraction into any app. More than 200 businesses worldwide use the Scanbot SDK, including DAX 30 and Fortune 500 companies. Scanbot is backed by three venture capital companies: Freigeist, Target Partners, and Evoco.</p>\n<p>We are looking for a Senior Cross-Platform Developer (m/f/d) here in Bonn. In this role, you will develop and integrate innovative core features for our successful B2B product Scanbot SDK using the cross-platform frameworks Xamarin & Xamarin.Forms, Flutter, React Native, Cordova, and Capacitor as well as web technologies like WebAssembly. You will be joining an experienced, multicultural, and enthusiastic team, with lots of great opportunities for professional, and personal growth. Your code will be used by millions of users every month!</p>\n<p><strong>What you will be doing</strong></p>\n<ul>\n<li>Help architect, build, iterate, and manage our SDK.</li>\n<li>Integrate existing and new functionality into our cross-platform wrappers.</li>\n<li>Develop and maintain our SDK example apps for iOS, Android, and Web.</li>\n<li>Research and develop plugin solutions for new cross-platform technologies.</li>\n<li>Partner closely with product management to continuously improve our product offering.</li>\n<li>Help to raise the overall skill and quality level through pairing, design/code reviews.</li>\n<li>Design and implement automated tests.</li>\n<li>Investigate and fix bugs reported by the QA team and our customers.</li>\n<li>Improve the cutting edge scanning and data extraction SDK.</li>\n<li>Research and use new technologies like AI and ML.</li>\n</ul>\n<p><strong>What we are looking for</strong></p>\n<ul>\n<li>3+ years of experience in developing Android and iOS applications is desirable.</li>\n<li>Good programming skills in Kotlin, Java, Swift, and Objective-C.</li>\n<li>Good programming skills in at least one of the following languages: JavaScript, TypeScript, C#.</li>\n<li>Willingness to become a good coder in all of them.</li>\n<li>Experience with at least two of the following cross-platform technologies: Cordova or Capacitor, React - Native, Flutter, Xamarin, WebAssembly. Willingness to become an expert in all of them.</li>\n<li>Experience with web frameworks like Angular, React or Vue.js is a plus.</li>\n<li>Understanding of Android and iOS design principles.</li>\n<li>Experience with common software development tools like git (GitHub), bug, and issue tracking (JIRA).</li>\n<li>Fluency in English.</li>\n<li>Experiences in the following areas would be a plus:</li>\n<li>Experience in testing mobile and web apps (unit and integration tests).Fluency in German or other languages.</li>\n</ul>\n<p><strong>What you can expect from us</strong></p>\n<ul>\n<li>Responsibility from the day you start.</li>\n<li>Flat hierarchies with the opportunity to influence the company from the beginning.</li>\n<li>An experienced and inspiring team that is willing to ship improvements and features continuously.</li>\n<li>A multitude of possibilities to improve professionally and personally.</li>\n<li>A “get it done” policy and fast decision making in a motivated, diverse, and open-minded team.</li>\n<li>A lived, mutual feedback culture.</li>\n<li>Be part of a company with sustained strong growth - we are just getting started.</li>\n<li>State of the art tools and equipment (latest MacBooks / mobile devices/displays).</li>\n<li>Beautiful and modern office right next to the Rhine river.</li>\n<li>Easily accessible by train and car from the whole Cologne / Bonn area.</li>\n<li>An agile and flexible way of working.</li>\n<li>Sweet and healthy snacks and a large selection of drinks.</li>\n<li>\"Come as you are Dresscode\".</li>\n<li>Lived Work-life balance.</li>\n<li>And many more benefits.</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://scanbot.join.com/jobs/2190458-senior-cross-platform-developer-m-f-d-for-our-location-in-bonn?pid=357a3b4531918760973f&amp;oid=c9dbdbcf-caff-4367-a266-438ae2667fa3&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bcross-platform%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn\">https://scanbot.join.com/jobs/2190458-senior-cross-platform-developer-m-f-d-for-our-location-in-bonn?pid=357a3b4531918760973f&amp;oid=c9dbdbcf-caff-4367-a266-438ae2667fa3&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bcross-platform%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2lpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2500cf676e655afcc4ca030a67534201e3fe4ed/scanbot-sdk-1567511514-logo.png"
  },
  {
    "id": "94b288ab-8209-4b00-b8f4-09cf249d75be",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/94b288ab-8209-4b00-b8f4-09cf249d75be",
    "created_at": "Wed Apr 28 12:49:22 UTC 2021",
    "company": "Yolawo",
    "company_url": "https://yolawo.de/",
    "location": "Stuttgart",
    "title": "Future Frontend Lead Developer",
    "description": "<p>#remote</p>\n<p>Wir ermöglichen Vereinen eine begeisternd einfache Kommunikation und Organisation rund um ihr Vereinsleben. Unsere Buchungs- und Verwaltungslösung konnte in 2020 mehr als 1,5 Mio. Sportteilnahmen abwickeln und tausenden Ehrenamtlichen die Vereinsarbeit erleichtern. Um unser starkes Wachstum nachhaltig auszubauen, wollen wir unsere Entwicklungsgeschwindigkeit weiter steigern und dafür brauchen wir Unterstützung!</p>\n<p>Aufgaben</p>\n<p>Wir suchen unsere/n “Future Frontend Lead Developer”. Als solche/r bekommst du sukzessive die Verantwortung über die Entwicklung im Frontend und wächst dabei mit weiteren Einstellungen in deine zukünftige Lead-Rolle. Erfahrung mit der Entwicklung von Angular Applikationen ist deshalb eine wichtige Voraussetzung. Auch wenn Berufserfahrung von Vorteil ist, glauben wir auch an das Potential von jungen, motivierten Talenten. Wenn du Absolvent/in bist und bereits in größeren Projekten mit Angular gearbeitet hast, wollen wir dich ermutigen, dich trotzdem zu bewerben.\nQualifikation</p>\n<p>Wir möchten dir eine unbürokratische Bewerbung ermöglichen. Bewerbe dich also gerne formlos. In deiner Bewerbung sollte klar werden, warum wir ein erstes Gespräch mit dir führen sollen. Außerdem bitten wir dich eine kleine Code-Challenge für uns zu lösen. Mehr dazu findest du am Ende des Textes. Wenn du unser Interesse geweckt hast, klären wir in einem ersten kurzen Gespräch (ca. 15 min Telefonat oder Video-Call) die offenen Fragen und den weiteren Verlauf des Bewerbungsprozess.</p>\n<p>Grundvoraussetzungen</p>\n<pre><code>Erfahrung mit Angular\nInteresse Softwarearchitektur\nInteresse Clean Code\nGute Kommunikation\nDeutsch in Sprache &amp; Schrift\n</code></pre>\n<p>Eckdaten zur Stelle</p>\n<pre><code>30 - 40 Wochenstunden\nArbeitsort flexibel, ca. 1-2 Treffen pro Monat in Stuttgart oder Tübingen\nKernarbeitszeit 10-14 Uhr\nAb 1. Juli (flexibel, deine Kündigungsfrist ist kein Problem)\n</code></pre>\n<p>Eckdaten zum Unternehmen</p>\n<pre><code>6 Mitarbeiter\n&gt; 300 Kunden\n&gt; 1,5 Mio Kursbuchungen in 2020\nWachstum von 2019 auf 2020 &gt; 800%\nSaaS, B2B\nAWS, Angular, Spring Boot\n</code></pre>\n<p>Unser Prozess</p>\n<p>Der Einstellungsprozess besteht aus drei Runden, in denen du mit unserem CTO und evtl. einem weiteren Frontend-Entwickler zusammenarbeitest. Der Probetag wird, wenn es Corona zulässt, vor Ort in Stuttgart oder Tübingen stattfinden und vergütet. Die zwei ersten Runden finden als Video-Call statt.</p>\n<pre><code>Bewerbungsphase\nRunde 1 (Pair Programming Bugfix: 30 Minuten)\nRunde 2 (Pair Programming Grüne Wiese: 90 Minuten)\nRunde 3 (Probetag)\nEntscheidung\n</code></pre>\n<p>Die Code-Challenge</p>\n<p>Schreibe eine sehr kleine Angular-App, die ein kleines Formular jeweils als “template-driven” und “reactive” implementiert. Bitte füge deine Lösung dann als herunterladbares ZIP-Archiv per URL in deine Bewerbung ein.</p>\n<p>Wenn du Interesse hast dein volles Potential in unser junges Unternehmen einzubringen und gemeinsam mit uns weiter zu wachsen, dann freuen wir uns auf deine Bewerbung!</p>\n<p>--&gt; Bewerbung: <a href=\"https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\">https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d</a></p>\n",
    "how_to_apply": "<p>Bewerbe dich jetzt unter:\n<a href=\"https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\">https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaW1pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cc853c6abac6a29b8face8bd94af39b10514b89b/Yolawo%20Logo%201.png"
  },
  {
    "id": "a9ec9eef-e7e5-4fe4-a44a-9bd1f0585628",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a9ec9eef-e7e5-4fe4-a44a-9bd1f0585628",
    "created_at": "Fri Apr 23 13:28:48 UTC 2021",
    "company": "IT&I",
    "company_url": "https://iti-software.de",
    "location": "Berlin",
    "title": "Software Entwickler WPF / Angular (m/w/d)",
    "description": "<p>Mit über 55 Mitarbeitern ist die IT&amp;I GmbH ein bundesweit agierendes in Berlin-Mitte ansässiges Unternehmen für Softwareentwicklung und -Beratung. Wir entwickeln und betreiben maßgeschneiderte Softwareanwendungen für die Energiewirtschaft. Dabei unterstützen wir unsere Kunden bei der Umsetzung der IT-Anforderungen in einem durch die Energiewende geprägten dynamischen Umfeld mit agilen Methoden.</p>\n<p><strong>Aufgaben</strong></p>\n<ul>\n<li>Du konzipierst und entwickelst innovative Software für Desktop-Anwendungen mit WPF</li>\n<li>Du migrierst gemeinsam mit deinem agilen Team eine umfangreiche WPF-Anwendung nach Angular</li>\n<li>Du verwendest C# .NET (Core) und Angular</li>\n<li>Durch vorgegebene Mock-ups setzt du die Designs um</li>\n<li>Du bindest Backend-Services an</li>\n<li>Du arbeitest eng mit dem Kunden zusammen</li>\n</ul>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Du hast mehrere Jahre Berufserfahrung als Software Entwickler und Erfahrung in der Umsetzung von Anwendungen mit WPF</li>\n<li>Du kennst dich in der Softwarearchitektur (MVVM) aus</li>\n<li>Ein Plus für dich wären Erfahrungen mit anderen Frameworks (Angular, React, EF), in der Backendentwicklung und mit Prozess- oder CI-Tools (Azure DevOps)</li>\n<li>Du bringst bereits Grundkenntnisse in relationalen Datenbanken mit</li>\n<li>Dependency Injection und Clean Code sind keine Fremdwörter für dich</li>\n<li>Du hast einen Fach- oder Hochschulabschluss der Informatik oder eine vergleichbare Qualifikation</li>\n<li>Du bist teamfähig, verfügst über Lernbereitschaft und Kommunikationsbereitschaft</li>\n<li>Du verstehst Zusammenhänge, schaust über den Tellerrand hinaus und hast die Bereitschaft dich mit neuen Technologien, Tools und Prozessen zu beschäftigen</li>\n<li>Du bringst gute Deutsch- und Englischkenntnisse mit</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Werde Teil eines kreativen Teams mit flachen Hierarchien und nutze die Chance gemeinsam mit uns zu wachsen</li>\n<li>Arbeite in unserem zentralen und modernen Büro in Berlin-Mitte</li>\n<li>Kostenfreie Getränke (Kaffee, Tee, Wasser, Mate), Obst und Süßigkeiten unterstützen deine Kreativität – mit unserer Siebträgermaschine kommen auch Kaffeeliebhaber auf ihre Kosten</li>\n<li>Wir haben flexible Arbeitszeiten und Homeoffice-Möglichkeiten</li>\n<li>Feier mit uns unsere Erfolge bei Teamevents oder Firmenfeiern (Beachvolleyball, Badminton, Firmenlauf, uvm.) und nutze zum Austausch unsere Gemeinschaftsküchen, Kicker, Nintendo Switch oder unser kleines Kino</li>\n<li>Du erhältst eine unbefristete Anstellung in einem sicheren und wachsenden Unternehmen</li>\n<li>Neben einem neuen Firmenhandy erwartet dich eine attraktive Vergütung</li>\n</ul>\n<p><strong>Wir haben dich neugierig gemacht?</strong></p>\n<p>Dann bewirb dich jetzt und sende uns deine aussagekräftige Bewerbung (deine Bewerbung sollte max. 10 Anhänge haben oder 10MB groß sein). Wir freuen uns auf dich!</p>\n",
    "how_to_apply": "<p><a href=\"https://iti-software.join.com/jobs/2123656-software-entwickler-wpf-angular-m-w-d?pid=357a3b4531918760973f&amp;oid=555b6899-0528-43ee-a059-12081871e3a7&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bentwickler%2Bwpf%2Bangular%2Bm%2Bw%2Bd\">https://iti-software.join.com/jobs/2123656-software-entwickler-wpf-angular-m-w-d?pid=357a3b4531918760973f&amp;oid=555b6899-0528-43ee-a059-12081871e3a7&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bentwickler%2Bwpf%2Bangular%2Bm%2Bw%2Bd</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjJoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3d47d167ed5ac2104bdd044a4bff03453d05ce53/it&i.jpg"
  },
  {
    "id": "b29d72a6-f2dd-4e77-8ab9-93d58c21aa8e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b29d72a6-f2dd-4e77-8ab9-93d58c21aa8e",
    "created_at": "Thu Apr 15 11:23:13 UTC 2021",
    "company": "be+ GmbH",
    "company_url": "https://www.beplus.de/",
    "location": "Schwabach",
    "title": "Frontend-Developer (w/m/d)",
    "description": "<p>Wir sind eine Truppe von 11 Frauen &amp; Männern zwischen 23 &amp; 53 Jahren, die seit Februar 2020 gemeinsam ein Produkt bauen, das für Unternehmen im War for Talents einen entscheidenden Unterschied machen kann: wir entwickeln eine cloudbasierte Plattform, um die Benefits eines Unternehmens für alle easy nutzbar zu machen. Warum wir das machen? Weil wir 2 Sachen kacke finden: Wenn Mitarbeiter<em>innen sich nicht wertgeschätzt fühlen &amp; die Investitionen der Unternehmer</em>innen in ihre Belegschaft irgendwie nicht richtig ankommen. Das wollen wir gemeinsam mit Dir ändern.</p>\n<p><strong>Das machst du</strong></p>\n<p>Du entwickelst  &amp; setzt gemeinsam mit unserem Lead-Entwickler Viktor Oberflächen um, die unsere User täglich nutzen. Für die geile Optik von be+ arbeitet ihr mit unserem obersten Produktentwickler Robin zusammen. Euch stehen dafür modernste Technologien, wie cloudbasierte Microservice-Architekturen, REST APIs, reaktives Angular, Spring Boot, Docker &amp; Kubernetes zur Verfügung. Ihr seid dabei eigenverantwortlich unterwegs &amp; habt ein Maß an Gestaltungsfreiheit, das keine Wünsche übrig lässt.</p>\n<p>Kurz &amp; Knapp</p>\n<ul>\n<li>technische Konzeption &amp; Entwicklung von Responsive Web-Apps mit Angular</li>\n<li>Konzeption &amp; Weiterentwicklung bestehender Frontend-Architekturen</li>\n<li>Entwicklungsvorschläge zur User Experience einbringen &amp; umsetzen</li>\n</ul>\n<p><strong>Das brauchst du</strong></p>\n<ul>\n<li>mindestens 3 Jahre Praxiserfahrung in HTML, CSS/SASS, JavaScript sowie dem JS-Framework Angular</li>\n<li>Basiskenntnisse in Java, Docker &amp; REST</li>\n<li>Erfahrung mit agilen Entwicklungsmethoden, die wir auch für unsere Organisation nutzen können</li>\n<li>sehr gute Deutsch- &amp; Englischkenntnisse</li>\n<li>Affinität zur Gestaltungsfreiheit in Verbindung mit der Eigenschaft, eigenverantwortlich zu handeln</li>\n<li>das Mindset von „together is better“</li>\n<li>Offenheit für das Arbeiten in einem sich entwickelnden Umfeld</li>\n</ul>\n<p><strong>Das bekommst du</strong></p>\n<ul>\n<li>gutes Gehalt, obwohl wir ein Start Up sind</li>\n<li>30 Tage Urlaub im Jahr</li>\n<li>deinen Spirit bei be+ einfließen lassen</li>\n<li>freie Gestaltung Deiner Arbeitszeit</li>\n<li>freie Auswahl Deiner Technik</li>\n<li>erstklassige Tipps für Deine Altersvorsorge durch unsere Vorsorgeexperten im Team</li>\n<li>Remote Work</li>\n<li>aus der Komfortzone gelockt werden &amp; merken, zu welchen geilen Sachen Du fähig bist</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/e77ac6eb6369e7a5bb52fe9e4cb6316d5cbf1d33/68747470733a2f2f742e676f686972696e672e636f6d2f682f30653233373832366637376161373531646532326666373336633564653638646631376163306163323261363633316364633432616332316361323562623136\"></p>\n",
    "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/55458843c665bddba94891e0a5cddf6c9e3caa8dfac50eb7e65ca8ba7565f489\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dfd8c9105d72fb2514e475eb08ec780f3ae7c30c/be+%20GmbH.jpeg"
  },
  {
    "id": "eab9550c-0977-498e-9973-ec4db95bbcf4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/eab9550c-0977-498e-9973-ec4db95bbcf4",
    "created_at": "Thu Apr 15 07:24:30 UTC 2021",
    "company": "Pazz GmbH",
    "company_url": "http://www.pazz.de",
    "location": "M͓̚͡ṳ̈͑͞ń̞́c͌҉̱h̹̄͡ę̟ͩn͈ͨ̀",
    "title": "T̸̟̾y̨̬̓p̨̩̿e̢̙ͥs̡̬̈c͍͐͠r͕̓͢i͈̔́p̧̜̑tͫ҉͉ ̷͖̚(͉ͣ̀J̛̜̆u͛҉̟n̲͑͝ỉ̦͠ö̢̩r̴͚͑/̵̺ͨSͬ҉͚e͖ͪ͠n̘ͬ͢i̴̞͆o̡͓͐r̸̞͑)̙͑̕",
    "description": "<pre><code>// checkout https://stackblitz.com/edit/pazz-job-offer\nimport { Component } from \"@angular/core\";\nimport { ApplicantService } from \"./services/applicant.service\";\nimport { EmployeeService } from \"./services/employee.service\";\n\n@Component({\n  selector: \"pz-job-offer\",\n  templateUrl: \"./job-offer.html\",\n  styleUrls: [\"./job-offer.less\"]\n})\nexport class JobOffer {\n  // TODO: use i18n logic\n  readonly TITLE = {\n    JOB_OFFER: \"(Junior/Senior) Full Stack Entwickler (m/w/d)\",\n    TASKS: \"Deine Aufgaben:\",\n    QUALIFICATIONS: \"Deine Qualifikationen:\",\n    BENEFITS: \"Unsere Benefits:\"\n  };\n\n  readonly INFO_SNIPPET = \"Festanstellung - Vollzeit - München\";\n\n  readonly TASKS = [\n    \"Fullstack Development einer Webplattform mit Angular und Node\",\n    \"Design und Anbindung von REST-Services\",\n    \"Aufbauen der Deployement Umgebung / Testen der Applikation\",\n    \"Für komplexe Aufgabenstellungen möglichst einfache und wirkungsvolle Lösungen entwickeln und vorantreiben\"\n  ];\n\n  readonly QUALIFICATIONS = [\n    \"Abgeschlossenes Studium der Informatik, abgeschlossene Ausbildung zum Fachinformatiker oder vergleichbare Kenntnisse aus der Praxis\",\n    \"Sehr gute Kenntnisse in JavaScript, TypeScript, Angular, RxJs, Webpack, HTML5 und (S)CSS - oder ähnlichen Technologien \" +\n      \"(ein guter Entwickler ist nicht auf bestimmte Technologien angewiesen)\",\n    \"Interesse und Leidenschaft, zu lernen und mit neuen Technologien zu experimentieren\",\n    'Eine \"you build it, you run it\"-Mentalität',\n    \"Die Fähigkeit, selbstständig und ergebnisorientiert zu arbeiten\",\n    \"Gute Englischkenntnisse in Wort und Schrift\"\n  ];\n\n  readonly BENEFITS = [\n    \"Ein schneller 2 Schritte Einstellungsprozess (diese Ausschreibung verstehen und ein Interview)\",\n    \"Flexible Arbeitszeiten (Gleitzeit)\",\n    \"Hohe Eigenständigkeit und die Arbeit mit dem gesamten Tech-Stack von der Datenbank bis zum Browser\",\n    \"Ein kleines Team mit flachen Hierarchien\",\n    \"Abwechslungsreiche und interessante Arbeitsinhalte\",\n    \"30 Urlaubstage und kleine Teamevents\",\n    \"Sehr gute Entwicklungsmöglichkeiten\",\n    \"Möglichkeit eigene Ideen voranzutreiben\",\n    \"Einzigartige Herausforderungen wie Dezentralisierung, Echtzeit-Synchronisierung und alle Herausforderungen welche das aufbauen \" +\n      \"einer Plattform mit sich bringt\"\n  ];\n\n  readonly ABOUT_US =\n    \"Wir sind eine soziale Plattform für Newcomer im Filmbereich. Bei uns steht der Community Faktor im Vordergrund und kann mit der \" +\n    \"Projekt- und Stellensuche vereint werden. Unsere Vision: Wir möchten Newcomer im Filmbereich bei Ihrer Umsetzung von Projekten \" +\n    \"unterstützen. Wir wollen der Partner für Newcomer werden von der Filmidee bis zur Veröffentlichung des ersten eigenen Werks. \" +\n    \"Nicht nur die Stellen- und Projektsuche soll den Arbeitsalltag von Studierenden erleichtern und Ihnen dabei helfen neue \" +\n    \"Crewmitglieder zu finden. Sondern auch der Pazz Booster soll ein finanzieller Extra-Schub für eine besonders gelungene Filmidee\" +\n    \" sein.\";\n\n  readonly ADDON = \"Bewerbungen können auch an info@pazz.de geschickt werden.\";\n  readonly SORRY =\n    \"Schade das es nicht mit uns klappt. Wir hoffen du schaust bei uns nochmal vorbei.\";\n\n  constructor(\n    private employeeService: EmployeeService,\n    private applicantService: ApplicantService\n  ) {}\n\n  // TODO: move this code to service\n  checkQualifications() {\n    return this.QUALIFICATIONS.every(qualification =&gt; {\n      this.applicantService.currentApplicant.hasQualification(qualification);\n    });\n  }\n\n  canBeHired() {\n    return (\n      this.checkQualifications() &amp;&amp;\n      this.employeeService.isImpressionPositiveAfterInterview()\n    );\n  }\n}\n</code></pre>\n",
    "how_to_apply": "<p>Schreibe uns eine Mail mit Lebenslauf und Anschreiben an <a href=\"mailto:info@pazz.de\">info@pazz.de</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUdoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3f93fb8f00beac11ca1b8bb6924bbed60eca129/logo.png"
  },
  {
    "id": "80bf58f4-cdef-40d4-9abb-d31d49a47900",
    "type": "Part Time",
    "url": "https://jobs.github.com/positions/80bf58f4-cdef-40d4-9abb-d31d49a47900",
    "created_at": "Wed Apr 14 14:11:10 UTC 2021",
    "company": "Chemovator",
    "company_url": "https://www.chemovator.com/",
    "location": "Mannheim",
    "title": "Working Student Software Engineer (m/f/d)",
    "description": "<p>Chemovator is the business incubator of BASF. We provide a protected space to build commercial ventures from unconventional ideas. Our Venture Teams take full ownership of their idea, creatively explore their business, learn fast and pivot beyond corporate boundaries.</p>\n<p><strong>Venture Team</strong></p>\n<p><strong>sharcx</strong></p>\n<p>Our Venture Team sharcx develops cloud-based analytical services which allow B2B sales and marketers to drive sales by automatically increased customer satisfaction. The data analytics engine will decrease customer churn, improve customer satisfaction (e.g. NPS®) and increase the customer lifetime value. For more information, have a look at <a href=\"http://www.sharcx.com/\">www.sharcx.com</a>.</p>\n<p>We now want to grow our software development stream and we are looking for a motivated and highly self-driven working student to bring our continuous delivery process to the next level. Are you the right one to join us on this journey?</p>\n<p><strong>What you can expect from the role</strong></p>\n<ul>\n<li>You support our team with defining and evaluating our SDLC processes</li>\n<li>You identify potential for test automation and take through required steps to implement it</li>\n<li>You support the team with the implementation of features</li>\n<li>You support the team with managing bugs and the bug fixing process</li>\n</ul>\n<p><strong>What you bring to the table</strong></p>\n<ul>\n<li>You are currently studying (bachelor’s – minimum 5th semester or master’s degree) in the field of applied informatics / computer science or business informatics</li>\n<li>You have experience in agile software development and software testing procedures</li>\n<li>You have experience in C#, .NET Core and Angular</li>\n<li>You are interested in applying modern tools and automate the development flow</li>\n<li>You have experience with CI/CD tools (e.g. Jenkins, TeamCity, DevOps)</li>\n<li>You have experience with tools for (agile) software development (e.g. Jira, Git)</li>\n</ul>\n<p><strong>What you can expect from us</strong></p>\n<ul>\n<li>A steady interaction and dialogue with experienced experts from two worlds – corporate BASF and our wide external network</li>\n<li>Use the mass of experiences of your colleagues and our Entrepreneurs in Residence to develop yourself and your venture further</li>\n<li>Flexible working time and mobile work as well as usual perks of a company in the startup environment, e.g. free drinks and an inspiring atmosphere within an unconventional location in Mannheim</li>\n<li>A competitive salary and the potential opportunity to join sharcx full time after you have finished your studies</li>\n</ul>\n<p><strong>Thrilled?</strong></p>\n<p>Nothing is set in stone yet, so your input is highly welcome. Please contact Tobias Seeger with your relevant documents. We are looking forward to hearing from you!</p>\n<p><img src=\"https://camo.githubusercontent.com/71cd2f8024566adec9675d9afd1c185be08a0127/68747470733a2f2f742e676f686972696e672e636f6d2f682f65396639643839646239373562386135326634393131383662626265646436373764626565363731653862343735343634383338643238646639306139303837\"></p>\n",
    "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/8b245ec6b83c1968dfbb12265e01ca1f1c2b3305776354cf34f31a18178fb179\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6bfc599a580d4fdec3033dfe35e45f51da6cd9d5/Chemovator.png"
  },
  {
    "id": "6d580d54-b28a-4b1a-a098-56a504c3d87e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6d580d54-b28a-4b1a-a098-56a504c3d87e",
    "created_at": "Tue Apr 13 08:21:46 UTC 2021",
    "company": "GAIA AG",
    "company_url": null,
    "location": "Hamburg",
    "title": "PHP JS Developer (m/f/d)",
    "description": "<p>We are looking for a talented PHP &amp; Javascript Developer (m/w/d) to work in a team to manage both our backend and frontend applications.</p>\n<p>For this position, we are looking for someone who has in-depth knowledge of object-oriented PHP programming, an understanding of MVC designs, S.O.L.I.D principles, Design patterns and working knowledge of front-end technologies including HTML5, JavaScript, and CSS3. In addition to that, some level of experience in frontend frameworks is a bonus.</p>\n<p>Responsibilites\nWrite “clean” and well-designed code\nProduce detailed specifications\nWrite functional requirement documents and guides\nTroubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality\nContribute in all phases of the development lifecycle\nFollow industry best practices\nDevelop and deploy new features to facilitate related procedures and tools if necessary\nUpdating and altering application features to enhance performance\nStay up-to-date on emerging technologies</p>\n<p>Requirements\nFluent English language skills\nDemonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc\nExperience with PHP frameworks such as Laravel or Symfony.\nIdeally software development experience in PHP and Javascript\nDesirable experience with Javascript frontend frameworks such as ReactJS, AngularJS and/or VueJS.\nGood knowledge of relational databases, version control tools and of developing web services\nPassion for best design and coding practices and a desire to develop new bold ideas\nBS/MS degree in Computer Science, Engineering or a related subject is advantageous</p>\n<p>Our Offer\nHigh level of responsibility and collaboration with a world-class team of international, diverse and experienced scientists, doctors, market specialists and software developers\nMinimal steps to decision making with quick access to senior management\nBeing part of a fast-paced, dynamic and internationally growing company</p>\n<p>Does this pique your interest?\nThen please submit your application, including CV, cover letter, salary expectations and your earliest possible start date. Your application will be handled with confidentiality.</p>\n",
    "how_to_apply": "<p><a href=\"https://gaiafamily.kenjo.io/php-210223\">https://gaiafamily.kenjo.io/php-210223</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3bcf482259ac1450c73308d0e48c652b98b35c0a/GAIA%20Logo.PNG"
  },
  {
    "id": "11f26dd0-fa2a-4f10-b693-4d07c1143d18",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/11f26dd0-fa2a-4f10-b693-4d07c1143d18",
    "created_at": "Wed Apr 07 09:41:42 UTC 2021",
    "company": "Carl Zeiss AG",
    "company_url": "https://vonq.io/3fL29hH",
    "location": "Oberkochen",
    "title": "System Architekt / Senior Application Specialist - IT Service Management Tools (m/w/x)",
    "description": "<p>Sich etwas Neues trauen, über sich hinauswachsen und dabei die Grenzen des Machbaren neu definieren. Genau das ist es, was unsere Mitarbeiter täglich leben dürfen und sollen. Um mit unseren Innovationen ein Zeichen zu setzen und Großartiges zu ermöglichen. Denn hinter jedem erfolgreichen Unternehmen stehen eine ganze Menge faszinierende Menschen. <strong>Wir suchen Kollegen (m/w/x) die gerne Neues wagen</strong>.</p>\n<h2>Ihre Rolle</h2>\n<p>In unserem Team für IT Service Management erarbeiten Sie technische Konzeptionen, implementieren Applikationen in ServiceNow und agieren als kompetenter Ansprechpartner für unsere externen Entwicklungspartner hinsichtlich der technischen Konzepte. Darüber hinaus setzten Sie Anforderungen und Projekte in ServiceNow zusammen mit unseren externen Partnern um und zeigen innovative Lösungsansätze mit unserer ServiceNow Plattform auf.</p>\n<p>Außerdem werden Sie:</p>\n<ul>\n<li>den reibungslosen Plattformbetrieb in Zusammenarbeit mit unseren externen Dienstleistern sicherstellen</li>\n<li>die Wartbarkeit unserer ServiceNow Instanzen sicherstellen, indem Sie an der stetigen Verbesserung unserer Entwicklungsrichtlinien mitarbeiten</li>\n</ul>\n<h2>Sie haben</h2>\n<ul>\n<li>ein erfolgreich abgeschlossenes Studium in der Fachrichtung (Wirtschafts-)Informatik oder eine abgeschlossene Ausbildung als Fachinformatiker und bringen mehrjährige, einschlägige Berufserfahrung mit</li>\n<li>fundierte Kenntnisse in der Softwareentwicklung von Web-Applikationen, Erfahrung mit JavaScript, Angular JS, XML, JSON o.ä. sowie Routine in der Umsetzung von Schnittstellen mit SOAP und REST</li>\n<li>idealerweise Erfahrung in ServiceNow Entwicklung bzw. Administration und bringen schon Kenntnisse mit Service Mangement Prozessen mit</li>\n<li>sehr gute Deutsch- und Englischkenntnisse für den täglichen Austausch</li>\n</ul>\n<p>In einem offenen und modernen Umfeld mit zahlreichen Entwicklungs- und Weiterbildungsmöglichkeiten, arbeiten die Mitarbeiter bei ZEISS in einer Kultur, die von Expertenwissen und Teamgeist geprägt ist. All das wird getragen von der besonderen Eigentümerstruktur und dem langfristigen Ziel der Carl-Zeiss-Stiftung: Wissenschaft und Gesellschaft gemeinsam voranzubringen.</p>\n<h2>Heute wagen. Morgen begeistern.</h2>\n<p>Vielfalt ist ein Teil von ZEISS. Wir freuen uns unabhängig von Geschlecht, Nationalität, ethnischer und sozialer Herkunft, Religion, Weltanschauung, Behinderung, Alter sowie sexueller Orientierung und Identität auf Ihre Bewerbung.</p>\n<p>Jetzt, in weniger als 10 Minuten über das Bewerbungsformular bewerben: <a href=\"https://vonq.io/3fL29hH\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3fL29hH\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkdmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--47daa3ed2e4dd1e6922d8bee251f978226d661cc/Zeiss.jpeg"
  },
  {
    "id": "f65756e9-8aaa-4b20-841b-ca991d518f1c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f65756e9-8aaa-4b20-841b-ca991d518f1c",
    "created_at": "Wed Apr 07 09:16:54 UTC 2021",
    "company": "Carl Zeiss AG",
    "company_url": "http://www.zeiss.com",
    "location": "Oberkochen",
    "title": "Entwickler / Anwendungsbetreuer Service Management Tools (ServiceNow) (m/w/x)",
    "description": "<h2><strong>Entwickler / Anwendungsbetreuer Service Management Tools (ServiceNow) (m/w/x) München</strong></h2>\n<p>Sich etwas Neues trauen, über sich hinauswachsen und dabei die Grenzen des Machbaren neu definieren. Genau das ist es, was unsere Mitarbeiter täglich leben dürfen und sollen. Um mit unseren Innovationen ein Zeichen zu setzen und Großartiges zu ermöglichen. Denn hinter jedem erfolgreichen Unternehmen stehen eine ganze Menge faszinierende Menschen.\n​</p>\n<h2><strong>Wir suchen Kollegen (m/w/x) die gerne Neues wagen. Ihre Rolle:</strong></h2>\n<p>In unserem Team für IT Service Management erarbeiten Sie technische Konzeptionen, implementieren Applikationen in ServiceNow und agieren als kompetenter Ansprechpartner für unsere externen Entwicklungspartner hinsichtlich der technischen Konzepte. Darüber hinaus setzten Sie Anforderungen und Projekte in ServiceNow zusammen mit unseren externen Partnern um und zeigen innovative Lösungsansätze mit unserer ServiceNow Plattform auf.</p>\n<h2><strong>Außerdem werden Sie:</strong></h2>\n<ul>\n<li>den reibungslosen Plattformbetrieb in Zusammenarbeit mit unseren externen Dienstleistern sicherstellen</li>\n<li>die Wartbarkeit unserer ServiceNow Instanzen sicherstellen, indem Sie an der stetigen Verbesserung unserer Entwicklungsrichtlinien mitarbeiten</li>\n</ul>\n<h2><strong>Sie haben:</strong></h2>\n<ul>\n<li>ein erfolgreich abgeschlossenes Studium in der Fachrichtung (Wirtschafts-)Informatik oder eine abgeschlossene Ausbildung als Fachinformatiker und bringen mehrjährige, einschlägige Berufserfahrung mit</li>\n<li>fundierte Kenntnisse in der Softwareentwicklung von Web-Applikationen, Erfahrung mit JavaScript, Angular JS, XML, JSON o.ä. sowie Routine in der Umsetzung von Schnittstellen mit SOAP und REST</li>\n<li>idealerweise Erfahrung in ServiceNow Entwicklung bzw. Administration und bringen schon Kenntnisse mit Service Mangement Prozessen mit</li>\n<li>sehr gute Deutsch- und Englischkenntnisse für den täglichen Austausch\n​</li>\n</ul>\n<p>In einem offenen und modernen Umfeld mit zahlreichen Entwicklungs- und Weiterbildungsmöglichkeiten, arbeiten die Mitarbeiter bei ZEISS in einer Kultur, die von Expertenwissen und Teamgeist geprägt ist. All das wird getragen von der besonderen Eigentümerstruktur und dem langfristigen Ziel der Carl-Zeiss-Stiftung: Wissenschaft und Gesellschaft gemeinsam voranzubringen.</p>\n<h2><strong>Heute wagen. Morgen begeistern.</strong></h2>\n<p>Vielfalt ist ein Teil von ZEISS. Wir freuen uns unabhängig von Geschlecht, Nationalität, ethnischer und sozialer Herkunft, Religion, Weltanschauung, Behinderung, Alter sowie sexueller Orientierung und Identität auf Ihre Bewerbung.</p>\n<p>Jetzt, in weniger als 10 Minuten bewerben über das Bewerbungsformular.</p>\n<p><a href=\"https://vonq.io/3wCoxQ7\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3wCoxQ7\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXVmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e46df8c27614bb9da900b8316ee23af14dd2f409/Carl%20Zeiss%20logo.jpeg"
  },
  {
    "id": "c2261987-6847-42c1-bbc8-8682ca551d09",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c2261987-6847-42c1-bbc8-8682ca551d09",
    "created_at": "Tue Apr 06 14:16:48 UTC 2021",
    "company": "Hybrid Heroes",
    "company_url": "https://hybridheroes.de",
    "location": "Berlin",
    "title": "Junior Frontend Developer",
    "description": "<p><strong>At Hybrid Heroes we're looking for a Junior Frontend Developer to help us build outstanding cross platform mobile apps.</strong></p>\n<p>Are you interested in developing next-gen mobile apps? Does bad UX bug the %&amp;§! out of you? Do you know what the terms TypeScript and State Management mean? If you answered check, check and check, then we want you to join our team as a frontend developer and to become a cross platform app development expert!</p>\n<h2>About the job</h2>\n<ul>\n<li>Develop mobile apps using state-of-the-art cross platform frameworks such as React Native or Ionic\nContribute to projects from idea to launch and beyond within an agile environment</li>\n<li>Rise to exciting technical challenges with each new project and solve them with custom-tailored sets of technologies</li>\n<li>Work with a cross functional team of developers, testers and designers</li>\n<li>Be involved and help others, share your knowledge in pair programming sessions, presentations and on our blog</li>\n<li>Have a vote in refining our workflows and technology stack</li>\n</ul>\n<h2>Our tech stack</h2>\n<ul>\n<li>React Native</li>\n<li>Ionic</li>\n<li>Electron</li>\n<li>Redux</li>\n<li>TypeScript</li>\n<li>Flutter</li>\n<li>Docker</li>\n</ul>\n<h2>About you</h2>\n<ul>\n<li>Relevant university degree or a minimum of 2 years of relevant work experience</li>\n<li>You have developed web apps using Angular, React or Vue</li>\n<li>Familiar interfacing with common backend technologies such as REST, GraphQL or Firebase</li>\n<li>Proficient using git and source code hosting services</li>\n<li>Conceptual understanding of technologies such as TypeScript, Redux, Node.js, Docker</li>\n<li>Very good communication skills in English</li>\n</ul>\n<h2>About the company</h2>\n<ul>\n<li>A dynamic, motivated and international team. Our company language is English!</li>\n<li>Flexible working hours</li>\n<li>The freedom to work from home or our modern office in Berlin Schöneberg</li>\n<li>Lively team culture with regular events</li>\n<li>Flat hierarchies and everyday opportunities to learn, grow and develop</li>\n<li>A welcoming onboarding process where you will get to know everybody in the company and ship some code to production within the first day</li>\n</ul>\n<h2>Apply for the job</h2>\n<p>Do you want to join our team as our new Junior Frontend Developer? Then we'd love to hear about you!</p>\n",
    "how_to_apply": "<p><a href=\"https://hybridheroes.homerun.co/junior-frontend-developer/en/apply\">https://hybridheroes.homerun.co/junior-frontend-developer/en/apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1dmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f8a7a1786ebcc8cefe5813bbb73c26f1ea2c0a7e/thumbnail1616164169logo.png"
  }
]